&НаСервере
Функция СтатусПроведения()

	Возврат Объект.Проведен;

КонецФункции // СтатусПроведения()

&НаКлиенте
Процедура РедактированиеФормы()
	
	Если СтатусПроведения() = Истина Тогда	
		Элементы.СтандартныеРеквезиты.Доступность = Ложь;
		Элементы.ДанныеПН.Доступность = Ложь;
		Элементы.ТЧ.Доступность = Ложь;
	Иначе	
		Элементы.СтандартныеРеквезиты.Доступность = Истина;
		Элементы.ДанныеПН.Доступность = Истина;
		Элементы.ТЧ.Доступность = Истина;
	КонецЕсли;
	
КонецПроцедуры // РедактированиеФормы()


&НаСервере
Процедура ТЧПриИзмененииНаСервере()
	Товары = Объект.ТЧ;
	НомерСтроки = Элементы.ТЧ.ТекущаяСтрока;
	
	ДанныеСтроки = Объект.ТЧ.НайтиПоИдентификатору(НомерСтроки);
	Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(ДанныеСтроки.Номенклатура, "СправочникСсылка.Номенклатура") Тогда
		Возврат ;
	КонецЕсли;
	
	ПроверкиДанных.СтараяЦена = Справочники.Номенклатура.ПолучитьЦенуТовара(ПроверкиДанных.Номенклатура);

	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧПриИзменении(Элемент)
	ТЧПриИзмененииНаСервере();
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		Объект.Склад = Справочники.Склады.Основной_Роз;    
	КонецЕсли;
	//Объект.Контрагент = Константы.КонтрагентПоУмолчанию.Получить();

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии()
	РедактированиеФормы();
КонецПроцедуры

&НаСервере
Процедура ИзменениеСуммыНаСервере()
	Товары = Объект.ТЧ;
	Для Каждого ТМЦ Из Товары Цикл
		ТМЦ.Сумма = ТМЦ.Количество * ТМЦ.Цена;	
	КонецЦикла;
	Записать();

КонецПроцедуры

&НаКлиенте
Процедура ТЧКоличествоПриИзменении(Элемент)
	ИзменениеСуммыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТЧЦенаПриИзменении(Элемент)
	ИзменениеСуммыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТЧСуммаПриИзмененииНаСервере()
	Товары = Объект.ТЧ;
	Для Каждого ТМЦ Из Товары Цикл
		ТМЦ.Цена = ТМЦ.Сумма / ТМЦ.Количество;	
	КонецЦикла;
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура ТЧСуммаПриИзменении(Элемент)
	ТЧСуммаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТЧШтрихКодПриИзмененииНаСервере()
	
	ТекСтрокаИд = Элементы.ТЧ.ТекущаяСтрока;
	
	ТекСтрокаТовары = Объект.ТЧ.НайтиПоИдентификатору(ТекСтрокаИд);
	Если НЕ ЗначениеЗаполнено(ТекСтрокаТовары.ШтрихКод) Тогда
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = "";
		//Сообщение.Сообщить();      
		Возврат;
	КонецЕсли;
	НайденыйТовар = Справочники.Номенклатура.ГлобальныйПоискПоШтрихКоду(ТекСтрокаТовары.ШтрихКод); 
	Если НайденыйТовар = Неопределено Тогда  
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Товар не обнаружен!";
		Сообщение.Сообщить();                   
	Иначе
		ТекСтрокаТовары.Номенклатура = НайденыйТовар;  
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ТЧШтрихКодПриИзменении(Элемент)
	ТЧШтрихКодПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция  ПроверкаЗаполненияПолей()
	Если Объект.Контрагент.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого ТМЦ Из Объект.ТЧ Цикл
		//Если ТМЦ.Количество = 0 Тогда
		//	Возврат Ложь;
		//ИначеЕсли ТМЦ.Цена = 0 Тогда
		//	Возврат Ложь;
		//ИначеЕсли ТМЦ.Сумма = 0 Тогда
		//	Возврат Ложь;
		//ИначеЕсли ТМЦ.ЦенаНаПродажу = 0 Тогда
		//	Возврат Ложь;	
		//КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ПроверкаЗаполненияПолей() = Ложь Тогда
		Сообщить("В документе присутствуют незаполненые поля!");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	РедактированиеФормы();
КонецПроцедуры
