&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Инициализация значений по умолчанию
	// 2. Добавляем на форму значения из кода
	Объект.КоличествоПриходов = 5;
	Объект.КоличествоПродаж = 5;
КонецПроцедуры

&НаКлиенте
Процедура Сгенерировать(Команда)
	
	ПараметрыГенерации = Новый Структура;
	// Передаем только количества, остальное (Склад, Дата) выберет рандом сам
	ПараметрыГенерации.Вставить("КоличествоПриходов", Объект.КоличествоПриходов);
	ПараметрыГенерации.Вставить("КоличествоПродаж",   Объект.КоличествоПродаж);
	
	СгенерироватьНаСервере(ПараметрыГенерации);
	
	Сообщить("Генерация завершена!");
	
КонецПроцедуры

&НаСервере
Процедура СгенерироватьНаСервере(Параметры)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.СгенерироватьДанные(Параметры);
	
КонецПроцедуры