
&НаСервере
Процедура СоздатьНоменклатуруНаСервере()
	Если НоменклатураКоличество = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для А=1 По НоменклатураКоличество Цикл
		Ном = Справочники.Номенклатура.СоздатьЭлемент(); 
		Ном.Наименование = ОсновноеНазвание + " " + А;
		Ном.НазваниеНаЭтикетке = Ном.Наименование;
		Ном.НалоговаяГруппа = Справочники.НалоговыеГруппы.Неакциз; 
		Ном.ЕдиницаИзмирения = Перечисления.ЕдиницыИзмирения.Кг;
		Ном.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)
	СоздатьНоменклатуруНаСервере();
КонецПроцедуры
